


# Печать по строкам
# Задание 1

# print("Nothing")
# print("will work")
# print("unless you do")


# Задание 2

# print('“Anyone who')
# print('    stops')
# print('       learning is old,')
# print('          whether at twenty or eighty”.')
# print('                                Henry Ford')


# задание 3
#
# a = float(input("первое число: "))
# b = float(input("  второе число: "))
#
# # Вычисления
# sum = a + b
# minus = a - b
# umnojenie = a * b
#
# print("Сумма:", sum)
# print("Разность:", minus)
# print("Умножение:", umnojenie)

# задание 4

# chislo = float(input("число: "))
# procent = float(input("процент: "))
# result  = chislo5 * procent / 100
# print(f"{procent} процентов от {chislo} = {result}")

# задание 5

width = float(input("ширинf прямоугольника: "))
height = float(input("высота прямоугольника :"))
area = width * height
print("          🔎 Площадь прямоугольникf:   ", area)






# print("   Anyone who")
# print("stops")

